// String : ¹®ÀÚ¿­À» Á¦¾î
/*
 	java.lang => import¸¦ »ı·«ÇÒ ¼ö ÀÖ´Ù.
 	¹®ÀÚ¿­À» ÀúÀåÇÏ´Â ¹æ¹ı
 		1) String º¯¼ö¸í : "Hello java";
 		2) String º¯¼ö¸í : new String("Hello Java");// °°Àº ¹®ÀÚ¿­ => º°µµ·Î ÀúÀå
 					    ====
 					        »õ·Î¿î ¸Ş¸ğ¸®¿¡ ÀúÀå
 		String¿¡¼­ Á¦°øÇÏ´Â ±â´É
 		1) equals : ÀúÀåµÈ ¹®ÀÚ¿­ °°ÀºÁö ¿©ºÎ¸¦ È®ÀÎ (true/false) // ·Î±×ÀÎ ÇÒ ¶§ »ç¿ë
 		// char ¹è¿­À» °¡Áö°í Á¦¾îÇÏ´Â °Í
 				ID, PWD   ==> ·Î±×ÀÎ (´ë¼Ò¹®ÀÚ ±¸ºĞ)
 				¹®ÀÚ¿­Àº(==)À» »ç¿ëÇÏ¸é ¾ÈµÈ´Ù. -> ¹®ÀÚ¿­ ºñ±³´Â equals¸¦ ÀÌ¿ëÇØ¼­ ºñ±³¸¦ ÁøÇàÇØ¾ßÇÑ´Ù.
 				
 				String s = "Hello";
 				String s1 = "Hello";
 				String s2 = new String("Hello");
 				if(s==s1)  true ; //¹®ÀÚ¿­ ÀÚÃ¼ ÁÖ¼Ò
 				if(s == s2) false;
 				if(s.equals(s1)) 
 				" == " = µ¥ÀÌÅÍ °ªÀ» ºñ±³ÇÏ´Â °ÍÀÌ ¾Æ´Ï¶ó ÀúÀåµÈ ÁÖ¼Ò °ªÀ» ºñ±³ÇÏ´Â °ÍÀÓ
 				s.equals("hello") => µ¥ÀÌÅÍ °ªÀÌ ¼­·Î °°ÀºÁö ¹°¾îº¸´Â °Í
 				=> ¿øÇü
 					boolean equals(String data)
 					
 		2) substring : ¹®ÀÚ¿­À» ÀÚ¸¦ ¶§
 				String s = "0123456789";
 				substring(3) => 3¹øºÎÅÍ ¸Ç ¸¶Áö¸·±îÁö °¡Á®¿À´Â °Í
 				String s = "112ºĞ,15¼¼ÀÌ»ó°ü¶÷°¡"
 				substring(0,3) => "112"
 						    ==
 						    end-1 ==> 012 "ºĞ"±îÁö ÀÚ¸£°Ô µÇ¸é Á¤¼öÇüÀ¸·Î º¯È¯ÀÌ ¾î·Á¿ò
 						    	ÁÖ·Î È®ÀåÀÚ¸¦ ÀÚ¸¦ ¶§ substringÀ» °¡Á®¿È
 						    
 				substring(int start);
 				substring(int start,int end);
 			
 			(¾öÃ» ¸¹ÀÌ ³ª¿À´Â ÇÔ¼ö) Àß ±â¾ïÇØ¾ßÇÔ
 			ºÎÆ® ½ºÆ®¸³ÀÌ³ª ¹®ÀÚ¿­ÀÌ µğÀÚÀÎÀÇ Å©±â¿¡ ¹ÌÄ¡Áö ¸øÇÒ ¶§ ³²Àº ¹®ÀÚ¿­À» Àß¶ó¼­ ... À¸·Î Ç¥½ÃÇÏ°Å³ª
 			¹ØÀ¸·Î ³»·Á ÁÙ ¶§ substring ¸Ş¼­µå¸¦ »ç¿ëÇØ¼­ ÁøÇàÇÔ
 			µ¥ÀÌÅÍ¸¦ ±Ü¾î¿Ã ¶§¿¡µµ substringÀ¸·Î Àß¶ó¼­ »ç¿ë ex) 128ºĞ, 12¼¼ÀÌ»ó°ü¶÷°¡
 											    º¯¼ö : ½Ã°£(int)  µî±Ş (String)
 			
 			³ª¿Í ¸ÂÁö ¾Ê´Â µ¥ÀÌÅÍµéÀº ÀÚ¸£°í µé¾î¿Ã ¼ö ÀÖ¾î¾ß ÇÑ´Ù.
 		3) length : ¹®ÀÚ¿­ °³¼ö  => 1±ÛÀÚ´ç 2byte¾¿À¸·Î °è»êµÊ
 			String s = "Hello È«±æµ¿ ";
 			web°ú ¸ğ¹ÙÀÏ¿¡¼­ »ç¿ëµÇ´Â ³»¿ë
 		4) trim : ÁÂ¿ìÀÇ °ø¹é¹®ÀÚ Á¦°Å
 			String s = "Hello Java";
 			 		=> s.trim().length;  // s = Hello Java·Î »ı°¢ÇØ¾ßÇÔ
 			 		   trim() : ÁÂ¿ì¿¡ ÀÖ´Â °ø¹é¸¸ Á¦°ÅÇÔ (Áß°£¿¡ ÀÖ´Â °ø¹éÀº Á¦°Å µÇÁö ¾ÊÀ½)
 			 		   		 - »çÀÌÆ®¿¡ ·Î±×ÀÎ ÇÒ ¶§ ¹®ÀÚ¿­À» ¹Ş¾Æ¼­ ÀúÀåÇÏ°í °ø¹éÀº Á¦°ÅÇÏ°í ÁøÇàµÊ
 		5) startsWtih, endsWith  => ¿øÇÏ´Â ´Ü¾î¸¦ Ã£°Ô µµ¿ÍÁÖ´Â ¸Ş¼­µå
 			¼­Á¦½ºÆ®¸¦ ¸¸µé ¶§ »ç¿ë
 			startsWith -> ¾ÕÀÇ ¹®ÀÚ¿­ÀÌ °°À» ¶§ ±ÛÀÚ·Î ½ÃÀÛµÇ´Â ±ÛÀÚ¸¦ Ã£¾Æ¶ó
 			startsWith("ÀÚ¹Ù")
 			endsWith = ÀÚ¹Ù°¡ Æ÷ÇÔµÈ ±ÛÀÚ¸¦ Ã£¾Æ¶ó ( °Ë»ö±â¸¦ Ã£À» ¶§ »ç¿ë )
 		6) indexOf, lastIndexOf
 			¹®ÀÚÀÇ À§Ä¡(indexOf:¾Õ¿¡¼­, lastIndexOf: µÚ¿¡¼­)
 									=> ¾Õ¿¡¼­ ºÎÅÍ Ã£Áö¸¸ ±× µÚ¿¡ ÀÖ´Â °Í
 			String s = "Hello Java";
 						0123456789
 			s.indexOf('a'); ==> 7¹ø µµ¸ŞÀÎ ÁÖ¼Ò
 			s.lastindexOf('a'); ==> 9¹ø / °æ·Î ¸íÀ» Àß¶ó¼­ »ç¿ë ÇÒ ¶§ https://  ==> /µÚ¿¡¼­ Àß¶ó¼­ »ç¿ëÇÒ ¶§
 									==> È®ÀåÀÚ ¸íÀ» Àß¶ó¼­ °¡Á®¿Ã ¶§ a.aa.txt 
 		7) split (Á¤·Ä)
 			String s = "ÀÌº´Çå, ÇÏÁ¤¿ì, ¸¶µ¿¼®, ÀüÇıÁø, ¼öÁö";
 			=> ±¸ºĞÀ» ÇØ¼­ ÀÚ¸£°í ½ÍÀ» ¶§
 			String[] names = s.split(",")
 			Á¤±Ô½Ä
 			=====
 				211.238.142.181
 				211.238.142.180
 				211.238.142.1
 				211.238.142.23
 				211.238.142.0
 				ÀÌ¿Í °°Àº Çü½ÄÀ» °¡Áø °ÍÀ» Ã£¾Æ¶ó
 				[0-9]{1,3} : 0¿¡¼­ 9ÀÚ¸® ÀÏ ¶§ 1ÀÚ¸®~ 3ÀÚ¸®±îÁö
 				[0-9]{1,3}\\.[0-9]{1,3}\\.[0-9]{1,3}\\.[0-9]{1,3}\\.[0-9]{1,3}
 				-> ip ÁÖ¼Ò¸¦ ±Ü¾î¿Ã ¶§ »ç¿ë
 				-> ºòµ¥ÀÌÅÍ¿Í µ¥ÀÌÅÍ ¼öÁı¿¡ ÇÊ¼öÀû
 				var regex = /^.*(?=^.{8,15}$)(?=.*\d)(?=.*[a-zA-Z])(?=.*[!@#$%^&+=]).*$/;
 				
 		8) toUppercase, toLowerCase
 			´ë¹®ÀÚ º¯È¯			¼Ò¹®ÀÚ º¯È¯
 			String s = " Hello ";
 			s.toUpperCase() ==> Hello¸¦ ´ë¹®ÀÚ·Î ¹Ù²ã¶ó ==> HELLO
 			s.tolowerCase() ==> hello
 		
 		9) replace, relaceAll  => Á¤±Ô½Ä
 					Çü½Ä¿¡ ¸Â´Â °ÍÀ» °¡Áö°í ¿À´Â °ÍÀº ¾î·Á¿ò
 		 				--> ¹®ÀÚ Çü½ÄÆ²À» ¸¸µé¾î ÁÖ´Â °Í : Á¤±Ô½Ä
 		 
 					 String s = "113ºĞ";
 					 // [^] : Á¦¿ÜÇÑ´Ù¶ó´Â ÀÇ¹Ì(ºÎÁ¤)
 					 // ^[] : ½ÃÀÛµÈ´Ù.
 					 // $ ³¡ÀÌ ³µ´Ù.
 					 s.replaceAll("[^0-9]$","")  ==> 113
 					  					=> ¼ıÀÚ¸¦ Á¦¿ÜÇÑ ³ª¸ÓÁö¸¦ ÃßÃâÇØ¶ó
 					 s.replaceAll("^[0-9]","")  ==> 113
 					 s.replaceAll("[^°¡-ÆR]","") - ÇÑ±Û ÀüÃ¼
 					 s.repalceAll("[^A-Za-z]","") - ¿µ¹®À» Á¦¿ÜÇÏ°í ÀüºÎ Áö¿ö¶ó
 					 --> Æ®À§ÅÍ³ª ÆäÀÌ½ººÏ¿¡¼­ µ¥ÀÌÅÍ¸¦ ±Ü¾î ¿ÔÀ» ¶§ ³»¿ëµéÀ» Ãß·Á³»±â À§ÇØ¼­ »ç¿ë
 					 
 					Â¥ + --> Â¥·Î ½ÃÀÛÇÏ´Â ¸ğµç µ¥ÀÌÅÍ¸¦ °¡Á®¿À´Â °Í
 		  =========
 		    º¯°æ ==> String s ="Hello Java";
 		    		s.replace('a','b');  ==> Hellojbvb
 		    					--> ¹®ÀÚ'a'¸¦ ÀüºÎ 'b'·Î ¹Ù²ã¶ó
 		  µ¥ÀÌÅÍ¸¦ ±Ü¾î¿Ã ¶§ html·Î µÇ¾î ÀÖÁö ¾Ê´Â °æ¿ì°¡ ÀÖÀ½ ex) À¯Æ©ºê
 		  ¿À¶óÅ¬¿¡ ³ª¿È -> ÆĞÅÏÀ» °¡Áö°í ³ª¿È
 		
 		10) contanis() : Æ÷ÇÔµÈ ¹®ÀÚ¸¦ Ã£´Â °æ¿ì
 		 			-> equalsÀÇ °æ¿ì ¹®ÀÚ¿­ ÀüÃ¼¸¦ ÀĞ±â ¶§¹®¿¡ ¹®ÀÚ¿­ Áß°£¿¡ ÀÖ´Â ´Ü¾î¸¦ Ã£À» ¼ö´Â ¾øÀ½
 		 			ex) ³×ÀÌ¹ö ÃßÃµ °Ë»ö¾î : "Æ¯Á¤ °Ë»ö¾î"°¡ ºí·Î±×¿¡ ¾ó¸¶³ª °Ë»ö µÇ´ÂÁö¸¦ È®ÀÎ
 		
 		
 		 					
 */
import java.util.Scanner;
public class ¹®ÀÚ¿­Å¬·¡½º´Ù½Ã°øºÎ {

	static String[] autoComplete(String data) {
		
		String[] ss = {
				"ÀÚ¹Ù¿Í JSP", "ÀÚ¹Ù ÇÁ·Î±×·¡¹Ö", "½ºÇÁ¸µ 5", "AJAX¿Í JSP", "¸®´ö½º¿Í ¸®¾×Æ®",
				"ÀÚ¹Ù ¿À¶óÅ¬", "MVC ±¸Á¶", "ÄÚÆ²¸°°ú ¾Èµå·ÎÀÌµå","¸¶ÀÌ±¸¹Ì", "ÄÚÆ²¸° ÇÁ·Î±×·¥",
				"½ºÇÁ¸µ µ¥ÀÌÅÍ", "È¥ÀÚ ¹è¿ì´Â ÀÚ¹Ù", "Áö´ÉÇü À¥ ÇÁ·Î±×·¥","À¥ ÇÁ·Î±×·¥", "ÀÚ¹Ù À¥",
				"¿À¶óÅ¬ ÀÚ¹Ù"
				};
		String[] findDate = new String[10];
		int j =0;
		for(int i =0; i<ss.length; i++) {
//			if(ss[i].startsWith(data)) 
			if(ss[i].contains(data))
			{
			// true / falseÀ» µ¹·ÁÁÖ´Â ±â´ÉÀ» °¡Áö°í ÀÖÀ½
				findDate[j] =ss[i];// ³ªÁß¿¡´Â ¹è¿­¿¡ ÀúÀåÇÏÁö ¾Ê°í arraylist¸¦ »ç¿ëÇØ¼­ Ã£Àº °³¼ö¸¸Å­ °¡Á®¿À°Ô µÈ´Ù.
				j++;
			}
		}
		return findDate;
	}
	public static void main(String[] args) {
		Scanner sc = new Scanner(System.in);
		System.out.print("°Ë»ö¾î ÀÔ·Â : ");
		String data = sc.next();
		
		String[] fd = autoComplete(data);
		for(int i =0; i<fd.length; i++) {
			if(fd[i] != null) {
				System.out.println(fd[i]);
			}
		}
	
	}
}
